BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
static float valminimax[2][57] = {
  {0,
    0,0,0,0,0,0,
    0,0,0,0,0,0,
    0,0,0,0,100,
    0,0,0,0,0,0,
    -100,0,0,0,140,20,
    -20,130,-30,1,140,
    75,0.2,150,1000,140,0,
    130,1,0,0,0,0,
    0,0,0,0,0,0,0,
    61,150,300
  },
  {0,
    0,0,0,0,0,0,
    0,0,0,0,0,0,
    0,0,0,0,100,
    10,10,10,10,100,-40,
    0,10,10,10,140,500,
    -100,130,10,51,140,
    600,3,5000,4000,140,100,
    0,5,127,127,127,127,
    127,127,127,127,127,127,127,
    61,150,300
  }
};

float affichevaltonex, affichevaltonexneg;

void echelledevaleur(byte val3){
  affichevaltonex = (valminimax[1][count]-valminimax[0][count])*params[id][count]/valmaxcc[count]+valminimax[0][count];
  switch (val3){
  case 1 :
    LCD.setCursor(12,1); LCD.print("    "); 
    if (affichevaltonex >=0 && affichevaltonex < 10) {LCD.setCursor(13,1);}
    if (affichevaltonex > 9.99 && affichevaltonex <= 100) {LCD.setCursor(12,1);}
    if (affichevaltonex < 0 && affichevaltonex < -100) {LCD.setCursor(13,1);}
    if (affichevaltonex < 0 && affichevaltonex >= -100) {LCD.setCursor(12,1);}
    LCD.print((valminimax[1][count]-valminimax[0][count])*params[id][count]/valmaxcc[count]+valminimax[0][count]);
  break;
  case 2 :
    LCD.setCursor(12,1); LCD.print("    "); 
    if (affichevaltonex >=0 && affichevaltonex < 10) {LCD.setCursor(14,1);}
    if (affichevaltonex >=0 && affichevaltonex > 9 && affichevaltonex < 100) {LCD.setCursor(13,1);}
    if (affichevaltonex >=0 && affichevaltonex >= 100) {LCD.setCursor(12,1);}
    LCD.print(round((valminimax[1][count]-valminimax[0][count])*params[id][count]/valmaxcc[count]+valminimax[0][count]));
    LCD.setCursor(15,1); LCD.print("%"); 
  break;
  case 3 :
    LCD.setCursor(9,1); LCD.print("       "); LCD.setCursor(9,1); 
    if (params[id][count] >= 0 && params[id][count] < 2) {LCD.print(verbname[0]);}
    if (params[id][count] >= 2 && params[id][count] < 4) {LCD.print(verbname[1]);}
    if (params[id][count] >= 4 && params[id][count] < 6) {LCD.print(verbname[2]);}
    if (params[id][count] >= 6 && params[id][count] < 8) {LCD.print(verbname[3]);}
    if (params[id][count] >= 8 && params[id][count] < 10) {LCD.print(verbname[4]);}
  break;
  }
}

// ----------------------------------------------GESTTION BASE DE DONNEE
static const char* daTa = "Callback function called";
char *zErrMsg = 0;

static int db_open(const char *filename, sqlite3 **db) {
  sqlite3_open(filename, db);
  return 0;
}

static int call(void *daTa, int argc, char **argv, char **azColName) {
  static int m;
    for (m = 0; m<argc; m++){
      String val = argv[m];
      //String val2 = azColName[m];
      switch (choixbd){
        case 0 :
          //Serial.println("");Serial.print("m = ");Serial.println(m);
          if (m < 55) {params[i][m] = val.toInt(); paramsCopy [i][m] = val.toInt();}
          if (m == 55) {progChang[i][0] = val.toInt();}
          if (m == 56) {progChang[i][1] = val.toInt();}
          if (m > 56) {params[i][m] = val.toInt(); paramsCopy [i][m] = val.toInt();}
        break;
        case 1 :
        break;
      } 
    }
  id = 1;
  return 0;
}

static int db_exec(sqlite3 *db, const char *sql) {
  sqlite3_exec(db, sql, call, (void*)daTa, &zErrMsg);
  return 0;
}

void saveData() {
  if (db_open("/spiffs/base.db", &db_base)) return;
  sql = "UPDATE stomps SET ";
  for (i = 1; i < 57; i++){
    if (i < 55){
      if (params[id][i] != paramsCopy[id][i]) {
        sql += "'"+String(i)+"'="+String(params[id][i])+", "; 
      }
    }
    if (i == 55){
        sql += "'"+String(i)+"'="+String(progChang[id][0])+", "; 
    }
    if (i == 56){
        sql += "'"+String(i)+"'="+String(progChang[id][1]); 
    }
  }
  if (bank == 1 ) {sql += " WHERE stomps_id="+String(id)+";";}
  if (bank == 2 ) {sql += " WHERE stomps_id="+String(id+42)+";";}
  if (bank == 3 ) {sql += " WHERE stomps_id="+String(id+84)+";";}
  db_exec(db_base, sql.c_str());
  sqlite3_close(db_base);
  Serial.println(sql);
}

void readData (){
  choixbd = 0;
  if (db_open("/spiffs/base.db", &db_base)) return; 
  static byte o;
  Serial.print("Bank = "); Serial.println(bank);
  if (bank == 1 ) {o = id;}
  if (bank == 2 ) {o = id + 42;}
  if (bank == 3 ) {o = id + 84;}
  for (i = 1; i < 43; i++) {
    sql = "SELECT * FROM stomps WHERE stomps_id = " + String(o) + ";";
    db_exec(db_base, sql.c_str());
    o = o + 1;
    //Serial.println(sql);
  }
  sqlite3_close(db_base);
}
// ------------------------------------------FIN GESTTION BASE DE DONNEE

// ---------------------------------------------------------------ECRANS
void initEncoder(int val1) {
  switch (val1)  {
    case 1 :
      encoder1.setCount(params[id][amperoquick[1][count1]]);
      enc1last = params[id][amperoquick[1][count1]];
      encoder2.setCount(params[id][tonexquick[1][count2]]);
      enc2last = params[id][tonexquick[1][count2]];
    break;
    case 2 :
      encoder1.setCount(count);
      enc1last = count;
    break;
    case 3 :
      encoder1.setCount(params[id][count]);
      enc1last = params[id][count];
      encoder2.setCount(params[id][count]);
      enc2last = params[id][count];
    break;
    case 4 :
      encoder2.setCount(progChang[id][0]); enc2last = progChang[id][0];
    break;
    case 5 :
      encoder2.setCount(progChang[id][1]); enc2last = progChang[id][1];
    break;
    case 6 :
      encoder2.setCount(params[id][count]); enc2last = params[id][count];
    break;
  }
}

void Screens(byte choixscreen, int val2) {
  //LCD.clear();
  String texte;
  switch (choixscreen) {
    case 0 :
      LCD.clear();
      LCD.setCursor(1,0);
      LCD.print("AMPERO 2 STOMP");
      LCD.setCursor(5,1);
      LCD.print("TONE X");
    break;
    case 1 :
      if (count > 0 && count < 18){
        LCD.setCursor(0,0);
        if (texteline1 != "P:    *AMPERO II") {texteline1 = "P:    *AMPERO II"; LCD.print(texteline1);}
        texte = String(id) + " ";
        LCD.setCursor(2,0); LCD.print(texte);
      }
      if (count > 17 && count < 54){
        LCD.setCursor(0,0);        
        if (texteline1 != "P:       *TONE_X") {texteline1 = ("P:       *TONE_X"); LCD.print(texteline1);}
        LCD.setCursor(2,0); LCD.print(id);
      }
      if (count == 54){if (texteline1 != " Fin Sauvegd") {LCD.setCursor(5,0); texteline1 = " Fin Sauvegd"; LCD.print(texteline1);}}
      if (count == 55 or count == 56){if (texteline1 != " Prog Change") {LCD.setCursor(5,0); texteline1 = " Prog Change"; LCD.print(texteline1);}}
      LCD.setCursor(0,1);
      if (texteline2 != namescc[count]) {texteline2 = namescc[count]; LCD.print(texteline2);}
      LCD.setCursor(13,1); LCD.print("   ");
      LCD.setCursor(13,1); 
      if (count != 55 && count != 56) {
        if (val2 == 139 or val2 == 140) {
          if (val2 == 139) {LCD.setCursor(10,1); LCD.print(":  PRE"); val2 = 139;}
          else {LCD.setCursor(10,1); LCD.print(": POST"); val2 = 140;}
        }
        if (val2 == 130 or val2 == 129) {
            if (params[id][count] == 130) {LCD.print("ON "); val2 = 130;}
            else {LCD.print("OFF"); val2 = 129;}
        }
        if (params[id][count] < 128) {          
          if (count < 18) {LCD.print(params[id][count]);}
          if (count > 17) {
            if (valminimax[1][count] == 10) {echelledevaleur(1);}
            if (count == 22 or count == 40 or count == 53) {echelledevaleur(2);}
            if (count != 22 or count != 40 or count != 53 or valminimax[1][count] != 10 or count != 42) {LCD.print(params[id][count]);}
            if (count == 42) {echelledevaleur(3);}
          }
          val2 = -1;
        } 
      }
      if(count == 55) {LCD.print(progChang[id][0]); val2 = -1;}
      if(count == 56) {LCD.print(progChang[id][1]); val2 = -1;} 
    break;
    case 2 :
        LCD.setCursor(0,0);
        if (texteline1 != "P:     AMPERO II") {texteline1 = "P:     AMPERO II"; LCD.print(texteline1);}
        texte = String(id) + " ";
        LCD.setCursor(2,0); LCD.print(texte);
        LCD.setCursor(0,1);
        if (texteline2 != namequickamp[count1]) {texteline2 = namequickamp[count1]; LCD.print(texteline2);}
        LCD.setCursor(13,1); LCD.print("   ");
        LCD.setCursor(13,1);
        if (val2 == 139 or val2 == 140) {
          if (val2 == 139) {LCD.setCursor(10,1); LCD.print(":  PRE"); val2 = 139;}
          else {LCD.setCursor(10,1); LCD.print(": POST"); val2 = 140;}
        }
        if (val2 == 130 or val2 == 129) {
          if (val2 == 130) {LCD.print("ON "); val2 = 130;}
          else {LCD.print("OFF"); val2 = 129;}
        }
        if (params[id][amperoquick[1][count1]] < 128) {LCD.print(params[id][amperoquick[1][count1]]); val2 = -1;}
    break;
    case 3 :
        LCD.setCursor(0,0);
        if (texteline1 != "P:        TONE_X") {texteline1 = "P:        TONE_X"; LCD.print(texteline1);}
        //LCD.setCursor(0,0); LCD.print("P:");
        texte = String(id) + " ";
        LCD.setCursor(2,0); LCD.print(texte);
        LCD.setCursor(0,1);
        if (texteline2 != namequicktone[count2]) {texteline2 = namequicktone[count2]; LCD.print(texteline2);}
        LCD.setCursor(13,1); LCD.print("   ");
        LCD.setCursor(13,1);
        if (val2 == 139 or val2 == 140) {if (val2 == 139) {LCD.setCursor(10,1); LCD.print(":  PRE"); val2 = 139;}
          else {LCD.setCursor(10,1); LCD.print(": POST"); val2 = 140;}}
        if (val2 == 129 or val2 == 130) {
          if (val2 == 130) {LCD.print("ON "); val2 = 130;}
          else {LCD.print("OFF"); val2 = 129;}
        }
        if (params[id][tonexquick[1][count2]] < 128) {
          count = tonexquick[1][count2];
          //LCD.print(params[id][count]);
          if (valminimax[1][count] == 10) {echelledevaleur(1);}
          if (count == 22 or count == 40 or count == 53) {echelledevaleur(2);}
          if (count != 22 or count != 40 or count != 53 or valminimax[1][count] != 10 or count != 42) {LCD.print(params[id][count]);}
          if (count == 42) {echelledevaleur(3);}
          val2 = -1;
        }
    break;
    case 9 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("** CHARGEMENT **");
      LCD.setCursor(0,1);
      LCD.print("***** BANK *****");
    break;
    case 10 :
      LCD.clear();
      LCD.setCursor(0,0);
      LCD.print("** SAUVEGARDE **");
      LCD.setCursor(0,1);
      LCD.print("*** EN COURS ***");
    break;
  }
  oldid = id;
}

void displayColor1(byte color) {
  digitalWrite(ledscolor[0], bitRead(color, 2));
  digitalWrite(ledscolor[1], bitRead(color, 1));
  digitalWrite(ledscolor[2], bitRead(color, 0));
}

void displayColor2(byte color) {
  digitalWrite(ledscolor[5], bitRead(color, 2));
  digitalWrite(ledscolor[4], bitRead(color, 1));
  digitalWrite(ledscolor[5], bitRead(color, 0));
}

void encod1(byte valmini, byte valmaxi, byte pot, byte sel){
  switch (sel) {
    case 0 :
      pot = encoder1.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      midiblabla(amperoquick[0][count1], pot, canal2);
      params[id][amperoquick[1][count1]] = pot;
      encoder1.setCount(pot);
      enc1last = pot;
      Screens(2, params[id][amperoquick[1][count1]]);
    break;
    case 1 :
      pot = encoder1.getCount();
      if (pot > valmaxi) {pot = valmini;}
      if (pot < valmini) {pot = valmaxi;}        
      count = pot;
      encoder1.setCount(pot);
      enc1last = pot;
      Screens(1, params[id][count]);
    break;
  }
}

