BobFredGard/CTRL-ESP32-AMPERO-TONEX/src/main.cpp
void encod2(int valmini, int valmaxi, int pot, byte sel){
  switch (sel) {
    case 0 :
      pot = encoder2.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      midiblabla(tonexquick[0][count2], pot, canal1);
      Screens(3, pot);
      params[id][tonexquick[1][count2]] = pot;
      encoder2.setCount(pot);
      enc2last = pot;
    break;
    case 1 :
      pot = encoder2.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      if (count == 55) {
        progChange(tonevalbk, pot, canal1);
        progChang[id][0] = pot;
      }
      if (count == 56) {
        progChange(ampvalbk, pot, canal2);
        progChang[id][1] = pot;
        }
      if (count != 55 or count != 56){
        params[id][count] = pot;
        if (params[id][count] == 139 or params[id][count] == 140){
          if (params[id][count] == 139){midiblabla(totalcc[0][count], 0, canal1);}
          else {midiblabla(totalcc[0][count], 127, canal1);}
        }
        if (count > 17 && count < params[id][54]) {
          if (params[id][count] == 129){midiblabla(totalcc[0][count], 0, canal1);}
          if (params[id][count] == 130){midiblabla(totalcc[0][count], 127, canal1);}
          if (params[id][count] < 128){
            midiblabla(totalcc[0][count], pot, canal1);
          }
        }
        if (count > 0 && count < 18) {
          if (params[id][count] == 129){midiblabla(totalcc[0][count], 0, canal2);}
          if (params[id][count] == 130){midiblabla(totalcc[0][count], 127, canal2);}
          if (params[id][count] < 128){
            midiblabla(totalcc[0][count], pot, canal2);
          }
        }
      }        
      encoder2.setCount(pot);
      enc2last = pot;
    break;
    case 2 :
      pot = encoder2.getCount();
      if (pot > valmaxi) {pot = valmaxi;}
      if (pot < valmini) {pot = valmini;}
      params[id][42] = pot;
      encoder2.setCount(pot);
      enc2last = pot;
      typereverb();
    break;
  }
}

void commun(){
  Screens(1, params[id][count]);
  static int tmp, encvalMax, encvalMini;
  while (menus == 1) {
    initEncoder(2);
    if (count == 55){initEncoder(4);}
    if (count == 56){initEncoder(5);}
    if (count != 55 && count !=56){initEncoder(6);}
    if (enc1last != encoder1.getCount()) {encod1(1,56,count,1); } 
    if (enc2last != encoder2.getCount()) {
      if (count != 55 && count != 56) {
        if (params[id][count] == 139 or params[id][count] == 140){
          if (params[id][count] == 140) {tmp = 140; encvalMax = 140; encvalMini = 139;}
          else {tmp = 139; encvalMax = 140; encvalMini = 139;}
        }
        if (params[id][count] == 129 or params[id][count] == 130){
          if (params[id][count] == 130) {tmp = 130; encvalMax = 130; encvalMini = 129;}
          else {tmp = 129; encvalMax = 130; encvalMini = 129;}
        }
        if (params[id][count] < 128){
          if (params[id][count] < 128) {tmp = -1; encvalMax = valmaxcc[count]; encvalMini = 0; }
        }
      } 
      else {
        if (progChang[id][0] < 128 && count == 55){tonevalbk = 0;}
        if (progChang[id][1] < 128 && count == 56){ampvalbk =  0;}
        if (progChang[id][0] > 127 && progChang[id][0] < 151 && count == 55){tonevalbk = 1;}
        if (progChang[id][1] > 127 && progChang[id][1] < 257 && count == 56){ampvalbk = 1;}
        if (progChang[id][1] > 255 && progChang[id][1] < 301 && count == 56){ampvalbk = 2;}
        tmp = -1; encvalMax = valmaxcc[count]; encvalMini = 0; 
      }
    if (count != 42){encod2(encvalMini,encvalMax,count,1);}
    if (count == 42){encod2(0,valmaxcc[count],count,2);}    
    Screens(1, tmp);
    }
    if (digitalRead(5) == 0) {
      delay(250);
      if (digitalRead(23) == 0) {
        Screens(10, 0);
        saveData(); delay(250);
        count1 = 0; count2 = 0; 
        if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
      }
      count1 = 0; count2 = 0; 
      if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
    }
    if (digitalRead(23) == 0) {
      delay(250);
      if (digitalRead(5) == 0) {
        Screens(10, 0);
        saveData(); delay(250);
        count1 = 0; count2 = 0; 
        if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
      }
      count1 = 0; count2 = 0; 
      if(count<18) {startcharg = 2;} else{startcharg = 3;} break;
    }
  }
}

void BoutRot(byte choixrot, byte menu) {
  switch (choixrot) {
    case 1 :
      switch (menu) {
        case 0 :
          if (couleur1 == 1) {//displayColor1(rgbcolor[count1]);
            couleur1 = 2;
          }
          else {
            if (startcharg == 1){count1 = 0; startcharg = 0;}
            if (count1 > 0 && count1 < 6) {
              count1 = count1+1;
            }
            else {count1 = 1; count2 = 1;}
            initEncoder(1);
            byte tmp;
            if (params[id][amperoquick[1][count1]] > 135){
              if (params[id][amperoquick[1][count1]] == 139) {tmp = 139;}
              else {tmp = 140;}
            }
            if (params[id][amperoquick[1][count1]] > 128 && params[id][amperoquick[1][count1]] < 135) {
              if (params[id][amperoquick[1][count1]] == 130) {tmp = 130;}
              else {tmp = 129;}
            } 
            if (params[id][amperoquick[1][count1]] < 128) {tmp = -1;}
            if (startscreen != 1) {Screens(2, tmp);} else {startscreen = 0;}
            //displayColor1(rgbcolor[count1]);
          break;
          }
        case 1 : 
          // Screens(1, params[id][count]);
          count = 1;
          commun();
        break;
      }
    break;
    case 2 :
      switch (menu) {
        case 0 : 
          if (couleur2 == 1) {//displayColor2(rgbcolor[count2]); 
          couleur2 = 2;
          }
          else {
            if (startcharg == 1){count2 = 0; startcharg = 0;}
            if (count2 > 0 && count2 < 6) {
              count2 = count2+1;
            }
            else {count2 = 1; count1 = 1;}
            initEncoder(1);
            static byte tmp;
            if (params[id][tonexquick[1][count2]] > 135){
              if (params[id][tonexquick[1][count2]] == 139) {tmp = 139;}
              else {tmp = 140;}
            }
            if (params[id][tonexquick[1][count2]] > 128 && params[id][tonexquick[1][count2]] > 135) {
                if (params[id][tonexquick[1][count2]] == 130) {tmp = 130;}
                else {tmp = 129;}
              }
            if (params[id][tonexquick[1][count2]] > 128) {tmp = -1;}
            if (startscreen != 1) {Screens(3, tmp);} else {startscreen = 0;}
           // displayColor1(rgbcolor[count2]);
          }
        break;
        case 1 :
          count = 18;
          commun();
        break;
      }
    break;
  }
}

void choixprogchang(){
  if (progChang[id][0] < 128 or progChang[id][1] < 128){ampvalbk = 0; tonevalbk = 0;}
  if (progChang[id][0] > 127 && progChang[id][0] < 151){tonevalbk = 1;}
  if (progChang[id][1] > 127 && progChang[id][1] < 257){ampvalbk = 1;}
  if (progChang[id][1] > 255 && progChang[id][1] < 301){ampvalbk = 2;}
}

void firstcharg(){
  progChange(tonevalbk, progChang[id][0], canal1);
  delay(100);
  progChange(ampvalbk,  progChang[id][1], canal2);
  delay(100);
  for (i = 18; i < params[id][54]; i++){
    if (params[id][i] == 139) {MIDI.sendControlChange(totalcc[0][i], 0, canal1);}
    if (params[id][i] == 140) {MIDI.sendControlChange(totalcc[0][i], 127, canal1);}
    if (params[id][i] == 129) {MIDI.sendControlChange(totalcc[0][i], 0, canal1);}
    if (params[id][i] == 130) {MIDI.sendControlChange(totalcc[0][i], 127, canal1);}
    if (i == 42) {typereverb();}
    else {if (params[id][i] < 118) {MIDI.sendControlChange(totalcc[0][i], params[id][i], canal1);}}
    delay(5);
  }
  for (i = 1; i < 18; i++){
    if (i < 14) {
      if (params[id][i] == 129) {MIDI.sendControlChange(totalcc[0][i], 0, canal2);}
      else {MIDI.sendControlChange(totalcc[0][i], 127, canal2);}
    if (i > 13) {MIDI.sendControlChange(totalcc[0][i], params[id][i], canal2);}
    delay(5);
    }
  }
}

void chgtPedal() {
  if (progChang[id][0] != progChang[preid][0]) {progChange(tonevalbk, progChang[id][0], canal1);}
  delay(20);
  if (progChang[id][1] != progChang[preid][1]) {progChange(ampvalbk,  progChang[id][1], canal2);}
  delay(20);
  for (i = 18; i < params[id][54]; i++){
    if (params[id][i] != params[preid][i]) {
      if (i != 42) {
        if (params[id][i] == 139) {MIDI.sendControlChange(totalcc[0][i], 0, canal1);}
        if (params[id][i] == 140) {MIDI.sendControlChange(totalcc[0][i], 127, canal1);}
        if (params[id][i] == 129) {MIDI.sendControlChange(totalcc[0][i], 0, canal1);}
        if (params[id][i] == 130) {MIDI.sendControlChange(totalcc[0][i], 127, canal1);}
        if (params[id][i] < 118) {
          MIDI.sendControlChange(totalcc[0][i], params[id][i], canal1);
        }
      }
      else {typereverb();}
  delay(10);
    }
  }
  for (i = 1; i < 18; i++){
    if (params[id][i] != params[preid][i]) {
      if (params[id][i] == 129) {MIDI.sendControlChange(totalcc[0][i], 0, canal2);}
      if (params[id][i] == 130) {MIDI.sendControlChange(totalcc[0][i], 127, canal2);}
      if (count1 > 13) {MIDI.sendControlChange(totalcc[0][i], params[id][i], canal2);}
    }
  }
}

void selectBank() {
  choixprogchang();
  if (startcharg == 1) {readData(); choixprogchang(); firstcharg(); oldbank = bank;}
  if (bank != oldbank) {Screens(9, 0); readData(); oldbank = bank; texteline1 = "toto"; texteline2 = "toto"; Screens(2, 0);}
}

